Tekla Open API Reference for Tekla Structures 2025
RebarSplice.RebarSpliceBarPositionsEnum Enumeration
 The bar group positions in the splice.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarSpliceBarPositionsEnum
Public Enumeration RebarSpliceBarPositionsEnum
Members
Member name | Value | Description
SPLICE_BAR_ON_TOP | 0 |  Joined bars on top of each other.
SPLICE_BAR_PARALLEL | 1 |  Joined bars parallel to each other.
See Also
Reference
Tekla.Structures.Model Namespace